{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "backbone_output_dropout": 0.5,
  "chunk_overlap_size": 64,
  "classifier_dropout": 0.5,
  "classifier_prob": 0.5,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 512,
  "id2label": {
    "0": "SAFE",
    "1": "INJECTION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "label2id": {
    "INJECTION": 1,
    "SAFE": 0
  },
  "layer_norm_eps": 1e-12,
  "long_input": false,
  "max_len": 512,
  "max_position_embeddings": 512,
  "model_name": "prajjwal1/bert-small",
  "model_type": "bert",
  "num_attention_heads": 8,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.6",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
